### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:22",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:18" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:18/invocations" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "18" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "18" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8232492673773968879" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691857017653534800" -> "1691884651355931000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:22" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-12T16:17:55.814+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:22" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/2159d8c3b3cc591ab925bb3aaafe7ebd5574220050a75de40b075e01874be55a.zip" -> "builds/80bd7989d209f5b545b689d0d9321444ede9df13b62daca7edce855a5cec131d.zip"
!       s3_object_version           = "0xN_0b.5YLcCwB0f6Fn6CUPCLFGdw3rG" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "UEjEnsADTgyLWovL7ZnMEsAv8GjohJUEaov/RfhVvaY=" -> (known after apply)
!       source_code_size            = 26189081 -> (known after apply)
!       version                     = "22" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "f005a458f9c367094c45fbd5b2b48a4d-5" -> (known after apply)
!       id                     = "builds/2159d8c3b3cc591ab925bb3aaafe7ebd5574220050a75de40b075e01874be55a.zip" -> (known after apply)
!       key                    = "builds/2159d8c3b3cc591ab925bb3aaafe7ebd5574220050a75de40b075e01874be55a.zip" -> "builds/80bd7989d209f5b545b689d0d9321444ede9df13b62daca7edce855a5cec131d.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/2159d8c3b3cc591ab925bb3aaafe7ebd5574220050a75de40b075e01874be55a.zip" -> "builds/80bd7989d209f5b545b689d0d9321444ede9df13b62daca7edce855a5cec131d.zip"
!       tags                   = {
+           "Deployment" = "terraform"
        }
!       tags_all               = {
+           "Deployment" = "terraform"
        }
!       version_id             = "0xN_0b.5YLcCwB0f6Fn6CUPCLFGdw3rG" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/80bd7989d209f5b545b689d0d9321444ede9df13b62daca7edce855a5cec131d.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/80bd7989d209f5b545b689d0d9321444ede9df13b62daca7edce855a5cec131d.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6813785392262405376" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/2159d8c3b3cc591ab925bb3aaafe7ebd5574220050a75de40b075e01874be55a.zip" -> "builds/80bd7989d209f5b545b689d0d9321444ede9df13b62daca7edce855a5cec131d.zip"
!           "timestamp" = "1691857019097747000" -> "1691884652940747000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "7840145748318590106" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/2159d8c3b3cc591ab925bb3aaafe7ebd5574220050a75de40b075e01874be55a.zip" -> "builds/80bd7989d209f5b545b689d0d9321444ede9df13b62daca7edce855a5cec131d.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 8 to add, 1 to change, 7 to destroy.
```
</details>